#### Terraform Format Check 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_organizations_organization.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=445567079474]
aws_s3_object.terraform_remote_state: Preparing import... [id=organisation-stacksets-445567079474/terraform-remote-state.yaml]
aws_s3_bucket.organisation_stacksets: Preparing import... [id=organisation-stacksets-445567079474]
aws_s3_object.terraform_remote_state: Refreshing state... [id=terraform-remote-state.yaml]
aws_s3_bucket.organisation_stacksets: Refreshing state... [id=organisation-stacksets-445567079474]
data.aws_organizations_organization.current: Read complete after 0s [id=o-hexz300bjw]
aws_cloudformation_stack.terraform_remote_state: Preparing import... [id=terraform-remote-state]
aws_cloudformation_stack.terraform_remote_state: Refreshing state... [id=terraform-remote-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudformation_stack.terraform_remote_state will be updated in-place
  # (imported from "terraform-remote-state")
  ~ resource "aws_cloudformation_stack" "terraform_remote_state" {
        capabilities       = [
            "CAPABILITY_NAMED_IAM",
        ]
        disable_rollback   = false
        iam_role_arn       = null
        id                 = "terraform-remote-state"
        name               = "terraform-remote-state"
      ~ outputs            = {} -> (known after apply)
      ~ parameters         = {
          + "GithubOrganisation" = "nvthvniel"
          + "GithubRepository"   = "aws-terraform"
        }
        tags               = {}
      ~ tags_all           = {
          + "terraform" = "true"
        }
        template_body      = <<-EOT
            Parameters:
              "GithubOrganisation":
                Description: "Name of GitHub organisation"
                Type: "String"
              
              "GithubRepository":
                Description: "Name of GitHub repository"
                Type: "String"
            
            Resources:
            
              OIDCProvider:
                Type: AWS::IAM::OIDCProvider
                Properties:
                  ClientIdList:
                    - "sts.amazonaws.com"
                  Url: "https://token.actions.githubusercontent.com"
            
              IAMRole:
                Type: AWS::IAM::Role
                DependsOn: OIDCProvider
                Properties:
                  RoleName: "github-terraform"
                  Description: "Manage Terraform remote state via GitHub actions"
                  MaxSessionDuration: 3600 # 1 hour
                  AssumeRolePolicyDocument:
                    Version: "2012-10-17"
                    Statement:
                      - Effect: Allow
                        Principal:
                          Federated: !Sub "arn:aws:iam::${AWS::AccountId}:oidc-provider/token.actions.githubusercontent.com"
                        Action:
                          - 'sts:AssumeRoleWithWebIdentity'
                        Condition:
                          StringEquals:
                            "token.actions.githubusercontent.com:aud": "sts.amazonaws.com"
                          StringLike:
                            "token.actions.githubusercontent.com:sub": !Sub "repo:${GithubOrganisation}/${GithubRepository}:*"
                  ManagedPolicyArns:
                    - "arn:aws:iam::aws:policy/AdministratorAccess"
            
              S3Bucket:
                Type: AWS::S3::Bucket
                DeletionPolicy: "RetainExceptOnCreate"
                Properties:
                  BucketName: !Sub "terraform-remote-state-${AWS::AccountId}"
            
                  OwnershipControls:
                    Rules:
                      - ObjectOwnership: "BucketOwnerEnforced"
                  
                  PublicAccessBlockConfiguration:
                    BlockPublicAcls: True
                    BlockPublicPolicy: True
                    IgnorePublicAcls: True
                    RestrictPublicBuckets: True
              
              S3BucketPolicy:
                Type: AWS::S3::BucketPolicy
                DependsOn: IAMRole
                Properties:
                  Bucket: !Sub "terraform-remote-state-${AWS::AccountId}"
                  PolicyDocument:
                    Version: "2012-10-17"
                    Statement:
                      - Sid: "TerraformBucket"
                        Effect: "Allow"
                        Action:
                          - "s3:ListBucket"
                        Principal:
                          "AWS": !Sub "arn:aws:iam::${AWS::AccountId}:root"
                        Resource:
                          - !Sub "arn:aws:s3:::terraform-remote-state-${AWS::AccountId}"
            
                      - Sid: "TerraformApplyObject"
                        Effect: "Allow"
                        Action:
                          - "s3:PutObject"
                        Principal:
                          "AWS": !Sub "arn:aws:iam::${AWS::AccountId}:role/github-terraform"
                        Resource:
                          - !Sub "arn:aws:s3:::terraform-remote-state-${AWS::AccountId}/*"
            
                      - Sid: "TerraformPlanObject"
                        Effect: "Allow"
                        Action:
                          - "s3:GetObject"
                        Principal:
                          "AWS": !Sub "arn:aws:iam::${AWS::AccountId}:root"
                        Resource:
                          - !Sub "arn:aws:s3:::terraform-remote-state-${AWS::AccountId}/*"
              
              DynamoDBTable:
                Type: AWS::DynamoDB::Table
                DependsOn: IAMRole
                Properties:
                  TableName: !Sub "terraform-remote-state-${AWS::AccountId}"
                  TableClass: "STANDARD"
                  BillingMode: "PAY_PER_REQUEST"
                  AttributeDefinitions:
                    - AttributeName: "LockID"
                      AttributeType: "S"
                  KeySchema:
                    - AttributeName: "LockID"
                      KeyType: "HASH"
                  ResourcePolicy:
                    PolicyDocument:
                      Version: "2012-10-17"
                      Statement:
                        - Sid: "Terraform"
                          Effect: "Allow"
                          Action:
                            - "dynamodb:DescribeTable"
                            - "dynamodb:GetItem"
                            - "dynamodb:PutItem"
                            - "dynamodb:DeleteItem"
                          Principal:
                            "AWS": !Sub "arn:aws:iam::${AWS::AccountId}:root"
                          Resource:
                            - !Sub "arn:aws:dynamodb:${AWS::Region}:${AWS::AccountId}:table/terraform-remote-state-${AWS::AccountId}"
        EOT
      + template_url       = "https://organisation-stacksets-445567079474.s3.445567079474.amazonaws.com/terraform-remote-state.yaml"
        timeout_in_minutes = 3
    }

  # aws_cloudformation_stack_set.terraform_remote_state will be created
  + resource "aws_cloudformation_stack_set" "terraform_remote_state" {
      + arn                 = (known after apply)
      + call_as             = "SELF"
      + capabilities        = [
          + "CAPABILITY_IAM",
          + "CAPABILITY_NAMED_IAM",
        ]
      + execution_role_name = (known after apply)
      + id                  = (known after apply)
      + name                = "terraform-remote-state"
      + parameters          = {
          + "GithubOrganisation" = "nvthvniel"
          + "GithubRepository"   = "aws-terraform"
        }
      + permission_model    = "SERVICE_MANAGED"
      + stack_set_id        = (known after apply)
      + tags_all            = {
          + "terraform" = "true"
        }
      + template_body       = (known after apply)
      + template_url        = "https://organisation-stacksets-445567079474.s3.445567079474.amazonaws.com/terraform-remote-state.yaml"

      + auto_deployment {
          + enabled                          = true
          + retain_stacks_on_account_removal = false
        }

      + operation_preferences {
          + failure_tolerance_count   = 1
          + max_concurrent_percentage = 100
        }
    }

  # aws_cloudformation_stack_set_instance.terraform_remote_state will be created
  + resource "aws_cloudformation_stack_set_instance" "terraform_remote_state" {
      + account_id               = (known after apply)
      + call_as                  = "SELF"
      + id                       = (known after apply)
      + organizational_unit_id   = (known after apply)
      + region                   = "445567079474"
      + retain_stack             = false
      + stack_id                 = (known after apply)
      + stack_instance_summaries = (known after apply)
      + stack_set_name           = "terraform-remote-state"

      + deployment_targets {
          + organizational_unit_ids = [
              + "r-t0l4",
            ]
        }
    }

  # aws_s3_bucket.organisation_stacksets will be updated in-place
  # (imported from "organisation-stacksets-445567079474")
  ~ resource "aws_s3_bucket" "organisation_stacksets" {
        acceleration_status         = null
        arn                         = "arn:aws:s3:::organisation-stacksets-445567079474"
        bucket                      = "organisation-stacksets-445567079474"
        bucket_domain_name          = "organisation-stacksets-445567079474.s3.amazonaws.com"
        bucket_prefix               = null
        bucket_regional_domain_name = "organisation-stacksets-445567079474.s3.eu-west-2.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z3GKZC51ZF0DB4"
        id                          = "organisation-stacksets-445567079474"
        object_lock_enabled         = false
        policy                      = null
        region                      = "eu-west-2"
        request_payer               = "BucketOwner"
        tags                        = {}
      ~ tags_all                    = {
          + "terraform" = "true"
        }

        grant {
            id          = "fbbafde4d3582ecc05308f9bd09b9945519acaf529bb5755c0b3d8b9a8b6bba6"
            permissions = [
                "FULL_CONTROL",
            ]
            type        = "CanonicalUser"
            uri         = null
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = true

                apply_server_side_encryption_by_default {
                    kms_master_key_id = null
                    sse_algorithm     = "AES256"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # aws_s3_object.terraform_remote_state will be updated in-place
  # (imported from "organisation-stacksets-445567079474/terraform-remote-state.yaml")
  ~ resource "aws_s3_object" "terraform_remote_state" {
        arn                           = "arn:aws:s3:::organisation-stacksets-445567079474/terraform-remote-state.yaml"
        bucket                        = "organisation-stacksets-445567079474"
        bucket_key_enabled            = false
        cache_control                 = null
        checksum_crc32                = null
        checksum_crc32c               = null
        checksum_sha1                 = null
        checksum_sha256               = null
        content_disposition           = null
        content_encoding              = null
        content_language              = null
        content_type                  = "application/x-yaml"
        etag                          = "75a70a472c0f92460beef56efcaa67ba"
      + force_destroy                 = false
        id                            = "terraform-remote-state.yaml"
        key                           = "terraform-remote-state.yaml"
        metadata                      = {}
        object_lock_legal_hold_status = null
        object_lock_mode              = null
        object_lock_retain_until_date = null
        server_side_encryption        = "AES256"
      + source                        = "templates/terraform-remote-state.yaml"
        storage_class                 = "STANDARD"
        tags                          = {}
      ~ tags_all                      = {
          + "terraform" = "true"
        }
      + version_id                    = (known after apply)
        website_redirect              = null
    }

Plan: 3 to import, 2 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```